package public

import "fmt"

//六神特性
func (liu_shen *LiuShen) da_an() string {
	return liu_shen.大安
}
func (liu_shen *LiuShen) liu_lian() string {
	return liu_shen.留连
}
func (liu_shen *LiuShen) su_xi() string {
	return liu_shen.速喜
}
func (liu_shen *LiuShen) chi_kou() string {
	return liu_shen.赤口
}
func (liu_shen *LiuShen) xiao_ji() string {
	return liu_shen.小吉
}
func (liu_shen *LiuShen) kong_wang() string {
	return liu_shen.空亡
}

func Liu_Shen() {
	var liushen LiuShen

	liushen.大安 = "大安位属东方，以季节论属于春季，地支月份为寅卯辰月，天干为甲乙木\n" +
		"大安为青龙，为事业宫，主工作、学业，官职。\n"
		/*			"大安为青龙，为事业，为不动，为阴晴，为地震，为国家，" +
					"为政府，为领导，为同事，为学士，为老师，为财富，为单位，为机构，" +
					"为车，为孕，为婚姻，为雅事，为尊贵，为才华，为官员，" +
					"为名人，为父亲，丈夫，大姐，大师，大学，大学生，大脑，" +
					"为四肢，为首，为大肠，为肝胆等，占病是肝胆之病、头部疾病"*/

	liushen.留连 = "留连位属东南方，暗藏西南、东北、西北三角，以季节论为春夏，地支月份为辰巳月\n" +
		"留连为腾蛇，为田宅宫，主钱财田宅之事，女人阴私之事，主淫欲。\n"
		/*	"留连，为奴仆，为纠缠，为迟钝，为暗昧，为反复，" +
			"为阴私，为曲折，为四角，为狠毒，为梦魇，为神鬼，" +
			"为怪异，为蛇，为官司牵连，为脾胃，为肿瘤，为虚惊，为漫长，为滞留，"*/

	liushen.速喜 = "速喜位属南方，以季节论属于长夏，地支月份为巳午未月，天干为丙丁火\n" +
		"速喜为朱雀，为感情宫，主婚姻喜事，信息传播，报喜或喜讯，名誉和成就。\n"
		/*			"速喜，为朱雀，为红色，为叔叔，为婚姻，为感情，为迅速，" +
					"为迅猛，为晴，为风，为快，为飞，为跑，为文书，为喜事，为喜报，" +
					"为信息，为事件，为通知，为血，为伤，为头脑，为心血管，" +
					"为文章有成，为喜讯，为时机已到等含义。为带火字红字赤字的人或朱姓人。"*/

	liushen.赤口 = "赤口位属西方，以季节论属于秋季，地支月份为申酉戍月，天干为庚辛金。\n" +
		"赤口为白虎，为疾厄宫，主灾祸，争斗，官司，伤害，凶险之事。\n"
		/*			"赤口，为白虎，为丧，为伤灾，为打斗，为毒辣，" +
					"为疾厄，为病，为红色，为大赤色，为口舌，为官非，为兄弟，" +
					"为医生，为手术，为刀，为缺损，为刑法，为司法，为竞争，" +
					"为吵闹，为误会，为争论，为纠纷，为声音，为不安，为肺，" +
					"为足，为呼吸道，为口部，为血光，为打斗，为惊恐，为凶险， 为赤身裸体，一无所有"*/

	liushen.小吉 = "小吉位属北方，以季节论属于冬季，地支月份为亥子丑月，天干为壬癸水。\n" +
		"小吉为六合，为驿马宫，主出行或旅行，为财源，主风流之事。\n"
		/*			"小吉，为驿马，为动，为出行，为努力，为快，为变化，" +
					"为知识，为约定，为合作，为赴约，为财源，为酒食，为趋吉，为记忆，" +
					"为计划，为小孩，为贼人，为弟妹，为细小，为小姐，为小学，为肾，" +
					"为小肠，称心合意，事隧人意，和合，吉利，合作，小事可谋，通畅等等含义"*/

	liushen.空亡 = "空亡位属中央，以季节论属于冬春季节，地支月份为丑寅月，天干为戊已土。\n" +
		"空亡为勾辰，为福德宫，主阴德、报应，有外财和牢狱之象。\n"
		/*			"空亡，为勾陈，为福德，为田园，为屋，为土地，为父母，" +
					"为虚无，为空，为亡，为离世，为鬼魂，为亡命徒，为雾，" +
					"为隔离，为异地，为缺失，为牢狱等。空则虚，亡则失，" +
					"有不吉，无结果，忧虑，幻想，谋事落空，劳而无获，事不可为" +
					"，欠缺，亏损，犯小人，匪盗惊惶，惊疑扰乱等含义"*/

	fmt.Println(liushen.大安)
	fmt.Println(liushen.留连)
	fmt.Println(liushen.速喜)
	fmt.Println(liushen.赤口)
	fmt.Println(liushen.小吉)
	fmt.Println(liushen.空亡)
	fmt.Println("::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::")

}
